In [40]:
import numpy as np
import pandas as pd

In [255]:
df = pd.DataFrame({'From_To':['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis','Brussels_londOn'],
                   'FlightNumber':[10045,np.nan, 10065,np.nan,10085],
                   'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],
                   'Airline':['KLM(!)','<Air France>(12)','(British Airways.)','12.Air France','"Swiss Air"']})

In [256]:
df

              Airline  FlightNumber           From_To  RecentDelays
0              KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France>(12)           NaN      MAdrid_miLAN            []
2  (British Airways.)       10065.0  londON_StockhOlm  [24, 43, 87]
3       12.Air France           NaN    Budapest_PaRis          [13]
4         "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

In [257]:
#1 replace missing flight numbers with correctly incremented values and change to int
df['FlightNumber'].interpolate(inplace=True)
df['FlightNumber'] = df['FlightNumber'].astype(np.int32)
df

              Airline  FlightNumber           From_To  RecentDelays
0              KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France>(12)         10055      MAdrid_miLAN            []
2  (British Airways.)         10065  londON_StockhOlm  [24, 43, 87]
3       12.Air France         10075    Budapest_PaRis          [13]
4         "Swiss Air"         10085   Brussels_londOn      [67, 32]

In [258]:
#2 split the From_To column into new dataframe object
dftmp=pd.DataFrame
dftmp = pd.DataFrame(df.From_To.str.split('_',expand=True)[0])
dftmp[1] = pd.DataFrame(df.From_To.str.split('_',expand=True)[1])
cols = ['From','To']
dftmp.columns = cols
dftmp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [259]:
#3 switch From & To to title case display
dftmp.From = dftmp.From.str.title()
dftmp.To = dftmp.To.str.title()
dftmp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [260]:
#4 drop From_To and attach the temp df
df.drop(columns='From_To', inplace=True)
df = df.join(dftmp)
print(df)

              Airline  FlightNumber  RecentDelays      From         To
0              KLM(!)         10045      [23, 47]    London      Paris
1    <Air France>(12)         10055            []    Madrid      Milan
2  (British Airways.)         10065  [24, 43, 87]    London  Stockholm
3       12.Air France         10075          [13]  Budapest      Paris
4         "Swiss Air"         10085      [67, 32]  Brussels     London

In [261]:
#5 expand RecentDelays values into their own columns
delays = pd.DataFrame(df.RecentDelays.values.tolist())
cols = ['delay_1','delay_2','delay_3']
delays.columns =cols
df.drop(columns='RecentDelays', inplace=True)
df = df.join(delays)
print(df)

              Airline  FlightNumber      From         To  delay_1  delay_2  \
0              KLM(!)         10045    London      Paris     23.0     47.0
1    <Air France>(12)         10055    Madrid      Milan      NaN      NaN
2  (British Airways.)         10065    London  Stockholm     24.0     43.0
3       12.Air France         10075  Budapest      Paris     13.0      NaN
4         "Swiss Air"         10085  Brussels     London     67.0     32.0

   delay_3
0      NaN
1      NaN
2     87.0
3      NaN
4      NaN